arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_i2c_driver.c
/*
 * Copyright (c) 2014 - 2016, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_flexio_i2c_driver.h"
#include "fsl_interrupt_manager.h"
#include "fsl_flexio_hal.h"
#include "fsl_clock_manager.h"

/*******************************************************************************
 * Variables
 ******************************************************************************/

/*! @cond DRIVER_INTERNAL_USE_ONLY */

    /* Constraints used for baud rate computation */
#define DIVIDER_MIN_VALUE  1U
#define DIVIDER_MAX_VALUE  0xFFU

    /* Shifters/Timers used for I2C simulation */
#define TX_SHIFTER     0U
#define RX_SHIFTER     1U
#define SCL_TIMER      0U
#define CONTROL_TIMER  (SCL_TIMER+1U)

/* Table of base addresses for FLEXIO instances. */
static FLEXIO_Type * const g_flexioBase[FLEXIO_INSTANCE_COUNT] = FLEXIO_BASE_PTRS;

/* Pointer to runtime state structure.*/
void * g_flexioI2CStatePtr[FLEXIO_INSTANCE_COUNT] = {NULL};

/* Table for FLEXIO IRQ numbers */
static const IRQn_Type g_flexioIrqId[FLEXIO_INSTANCE_COUNT] = FLEXIO_IRQS;

/* PCC clock sources, for getting the input clock frequency */
static const clock_names_t g_flexioClock[FLEXIO_INSTANCE_COUNT] = {PCC_FLEXIO0_CLOCK};

/* Table to save FLEXIO ISRs - for installing interrupt handlers at runtime */
extern const isr_t g_flexioI2CIsr[FLEXIO_INSTANCE_COUNT];

/*******************************************************************************
 * Private Functions
 ******************************************************************************/


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterComputeBaudRateDivider
 * Description   : Computes the baud rate divider for a target baud rate
 *
 *END**************************************************************************/
static flexio_i2c_status_t FLEXIO_I2C_DRV_MasterComputeBaudRateDivider(uint32_t instance, uint32_t baudRate, uint16_t *divider)
{
    uint32_t inputClock;
    uint32_t tmpDiv;
    clock_manager_error_code_t clkErr;

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_I2C_STATUS_FAIL;
    }

    /* Compute divider: ((input_clock / baud_rate) / 2) - 1 - 1. The extra -1 is from the 
       timer reset setting used for clock stretching. Round to nearest integer */
    tmpDiv = (inputClock + baudRate) / (2U * baudRate) - 2U;
    /* Enforce upper/lower limits */
    if (tmpDiv < DIVIDER_MIN_VALUE)
    {
        tmpDiv = DIVIDER_MIN_VALUE;
    }
    if (tmpDiv > DIVIDER_MAX_VALUE)
    {
        tmpDiv = DIVIDER_MAX_VALUE;
    }
    
    *divider = (uint16_t)tmpDiv;
    return FLEXIO_I2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterConfigure
 * Description   : configures the FLEXIO module as I2C master
 *
 *END**************************************************************************/
static flexio_i2c_status_t FLEXIO_I2C_DRV_MasterConfigure(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_i2c_master_state_t *master;
    flexio_i2c_status_t retCode;
    uint16_t divider;

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    /* Compute divider.*/
    retCode = FLEXIO_I2C_DRV_MasterComputeBaudRateDivider(instance, master->baudRate, &divider);
    if (retCode != FLEXIO_I2C_STATUS_SUCCESS)
    {
        return retCode;
    }

    /* Configure SCL timer */
    FLEXIO_HAL_SetTimerCompare(baseAddr, SCL_TIMER, divider);
    FLEXIO_HAL_SetTimerInitialOutput(baseAddr, SCL_TIMER, FLEXIO_TIMER_INITOUT_ZERO);
    FLEXIO_HAL_SetTimerReset(baseAddr, SCL_TIMER, FLEXIO_TIMER_RESET_PIN_OUT);
    FLEXIO_HAL_SetTimerEnable(baseAddr, SCL_TIMER, FLEXIO_TIMER_ENABLE_TRG_HIGH);
    FLEXIO_HAL_SetTimerDisable(baseAddr, SCL_TIMER, FLEXIO_TIMER_DISABLE_TIM_CMP);
    FLEXIO_HAL_SetTimerStart(baseAddr, SCL_TIMER, FLEXIO_TIMER_START_BIT_ENABLED);
    FLEXIO_HAL_SetTimerStop(baseAddr, SCL_TIMER, FLEXIO_TIMER_STOP_BIT_TIM_DIS);
    FLEXIO_HAL_SetTimerTrigger(baseAddr, SCL_TIMER, (TX_SHIFTER << 2U)+1U, FLEXIO_TRIGGER_POLARITY_LOW, FLEXIO_TRIGGER_SOURCE_INTERNAL);
    FLEXIO_HAL_SetTimerPin(baseAddr, SCL_TIMER, master->sclPin, FLEXIO_PIN_POLARITY_HIGH, FLEXIO_PIN_CONFIG_OPEN_DRAIN);
    FLEXIO_HAL_SetTimerMode(baseAddr, SCL_TIMER, FLEXIO_TIMER_MODE_8BIT_BAUD);
    /* Configure control timer for shifters */
    FLEXIO_HAL_SetTimerCompare(baseAddr, CONTROL_TIMER, 0x000FU);
    FLEXIO_HAL_SetTimerDecrement(baseAddr, CONTROL_TIMER, FLEXIO_TIMER_DECREMENT_PIN_SHIFT_PIN);
    FLEXIO_HAL_SetTimerEnable(baseAddr, CONTROL_TIMER, FLEXIO_TIMER_ENABLE_TIM_ENABLE);
    FLEXIO_HAL_SetTimerDisable(baseAddr, CONTROL_TIMER, FLEXIO_TIMER_DISABLE_TIM_DISABLE);
    FLEXIO_HAL_SetTimerStart(baseAddr, CONTROL_TIMER, FLEXIO_TIMER_START_BIT_ENABLED);
    FLEXIO_HAL_SetTimerStop(baseAddr, CONTROL_TIMER, FLEXIO_TIMER_STOP_BIT_TIM_CMP);
    FLEXIO_HAL_SetTimerTrigger(baseAddr, CONTROL_TIMER, (TX_SHIFTER << 2U)+1U, FLEXIO_TRIGGER_POLARITY_LOW, FLEXIO_TRIGGER_SOURCE_INTERNAL);
    FLEXIO_HAL_SetTimerPin(baseAddr, CONTROL_TIMER, master->sclPin, FLEXIO_PIN_POLARITY_LOW, FLEXIO_PIN_CONFIG_DISABLED);
    FLEXIO_HAL_SetTimerMode(baseAddr, CONTROL_TIMER, FLEXIO_TIMER_MODE_16BIT);

    /* Configure tx shifter */
    FLEXIO_HAL_SetShifterStartBit(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_START_BIT_0);
    FLEXIO_HAL_SetShifterStopBit(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_STOP_BIT_1);
    FLEXIO_HAL_SetShifterTimer(baseAddr, TX_SHIFTER, CONTROL_TIMER, FLEXIO_TIMER_POLARITY_POSEDGE);
    FLEXIO_HAL_SetShifterMode(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_MODE_TRANSMIT);
    FLEXIO_HAL_SetShifterPin(baseAddr, TX_SHIFTER, master->sdaPin, FLEXIO_PIN_POLARITY_LOW, FLEXIO_PIN_CONFIG_OPEN_DRAIN);
    /* Configure rx shifter */
    FLEXIO_HAL_SetShifterStopBit(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_STOP_BIT_0);
    FLEXIO_HAL_SetShifterTimer(baseAddr, RX_SHIFTER, CONTROL_TIMER, FLEXIO_TIMER_POLARITY_NEGEDGE);
    FLEXIO_HAL_SetShifterPin(baseAddr, RX_SHIFTER, master->sdaPin, FLEXIO_PIN_POLARITY_HIGH, FLEXIO_PIN_CONFIG_DISABLED);
    FLEXIO_HAL_SetShifterMode(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_MODE_RECEIVE);

    return FLEXIO_I2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterSetBytesNo
 * Description   : configures the number of SCL clocks needed for the entire transmission
 *
 *END**************************************************************************/
static void FLEXIO_I2C_DRV_MasterSetBytesNo(FLEXIO_Type *baseAddr, flexio_i2c_master_state_t *master)
{
    uint16_t timerCmp;
    uint16_t bytesNo;

    /* Compute number of SCL ticks, including address */
    bytesNo = master->txRemainingBytes;
    bytesNo = bytesNo * 18U + 1U;
    /* Set number of ticks in low part of timer compare register */
    timerCmp = FLEXIO_HAL_GetTimerCompare(baseAddr, SCL_TIMER);
    timerCmp = (timerCmp & 0x00FFU) | (uint16_t)((bytesNo & 0xFFU) << 8U);
    FLEXIO_HAL_SetTimerCompare(baseAddr, SCL_TIMER, timerCmp);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterSendAddress
 * Description   : send address byte
 *
 *END**************************************************************************/
static void FLEXIO_I2C_DRV_MasterSendAddress(FLEXIO_Type *baseAddr, flexio_i2c_master_state_t *master)
{
    uint8_t addrByte;

    /* Address byte: slave 7-bit address + D = 0(transmit) or 1 (receive) */
    addrByte = (uint8_t)((master->slaveAddress << 1U) + (uint8_t)(master->receive));
    FLEXIO_HAL_WriteShifterBuffer(baseAddr, TX_SHIFTER, addrByte << 24U, FLEXIO_SHIFTER_RW_MODE_BIT_SWAP);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterWaitTransferEnd
 * Description   : waits for the end of a blocking transfer
 *
 *END**************************************************************************/
static flexio_i2c_status_t FLEXIO_I2C_DRV_MasterWaitTransferEnd(uint32_t instance)
{
    flexio_i2c_master_state_t *master;

    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    switch (master->driverType)
    {
        case FLEXIO_I2C_DRIVER_TYPE_INTERRUPTS:
            /* Wait for transfer to be completed by the IRQ */
            while (master->driverIdle == false);
            break;
        case FLEXIO_I2C_DRIVER_TYPE_POLLING:
            /* Call FLEXIO_I2C_DRV_MasterGetStatus() to do the transfer */
            while (FLEXIO_I2C_DRV_MasterGetStatus(instance, NULL) == FLEXIO_I2C_STATUS_BUSY);
            break;
        case FLEXIO_I2C_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    return master->status;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_ReadData
 * Description   : Handles data reception
 *
 *END**************************************************************************/
static void FLEXIO_I2C_DRV_ReadData(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_i2c_master_state_t *master;
    uint8_t data;

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master->rxRemainingBytes > 0);
#endif

    /* Read data from rx shifter */
    data = (uint8_t)FLEXIO_HAL_ReadShifterBuffer(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_RW_MODE_BIT_SWAP);

