arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_i2c_driver.c
    if (master->addrReceived == false)
    {
        /* This was the address byte */
        master->addrReceived = true;
        if (master->receive == true)
        {
            /* Send ACK from now on */
            FLEXIO_HAL_SetShifterStopBit(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_STOP_BIT_0);
        }
    }
    else
    {
        master->rxRemainingBytes--;
        if (master->receive == true)
        {
            /* Put data in user buffer */
            *(master->data) = data;
            master->data++;
        }
    }
    if ((master->receive == true) && (master->rxRemainingBytes == 1U))
    {
        /* Send NACK for last byte */
        FLEXIO_HAL_SetShifterStopBit(baseAddr, TX_SHIFTER, FLEXIO_SHIFTER_STOP_BIT_1);
        /* Also instruct rx shifter to expect NACK */
        FLEXIO_HAL_SetShifterStopBit(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_STOP_BIT_1);
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_WriteData
 * Description   : Handles data transmission
 *
 *END**************************************************************************/
static void FLEXIO_I2C_DRV_WriteData(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_i2c_master_state_t *master;
    uint32_t data;

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    /* If txRemainingBytes == 0 the transmission is over */
    if (master->txRemainingBytes == 0) 
    {
        return;
    }

    master->txRemainingBytes--;

    if (master->txRemainingBytes == 0)
    {
        /* Done transmitting */
        if (master->sendStop == true)
        {
            /* Transmit stop condition */
            data = 0x0;
        }
        else
        {
            /* Do not transmit stop condition */
            data = 0xFFU;
        }
    }
    else if (master->receive == true)
    {
        /* Transmit 0xFF to leave the line free while receiving */
        data = 0xFFU;
    }
    else
    {
        /* Read data from user buffer */
        data =  *(master->data);
        master->data++;
    }

    /* Shift data before bit-swapping it to get the relevant bits in the lower part of the shifter */
    data <<= 24U;
    FLEXIO_HAL_WriteShifterBuffer(baseAddr, TX_SHIFTER, data, FLEXIO_SHIFTER_RW_MODE_BIT_SWAP);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterStopTransfer
 * Description   : Forcefully stops the current transfer
 *
 *END**************************************************************************/
static void FLEXIO_I2C_DRV_MasterStopTransfer(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_i2c_master_state_t *master;

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    master->driverIdle = true;
    /* Call HAL_Init to reset module */
    FLEXIO_HAL_Init(baseAddr);
    /* Will re-initialize module on next use (not here because it takes a 
       long time and we may be inside an interrupt handler) */
    master->needReinit = true;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterEndTransfer
 * Description   : End the current transfer
 *
 *END**************************************************************************/
static void FLEXIO_I2C_DRV_MasterEndTransfer(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_i2c_master_state_t *master;

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    /* Restore Rx stop bit, in case it was changed by a receive */
    FLEXIO_HAL_SetShifterStopBit(baseAddr, RX_SHIFTER, FLEXIO_SHIFTER_STOP_BIT_0);
    /* Clear Rx status in case there is a character left in the buffer */
    FLEXIO_HAL_ClearShifterStatus(baseAddr, RX_SHIFTER);

    /* Disable transfer engine */
    switch (master->driverType)
    {
        case FLEXIO_I2C_DRIVER_TYPE_INTERRUPTS:
            /* Disable interrupts for Rx and Tx shifters */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, 
                                           (1U << TX_SHIFTER) | (1U << RX_SHIFTER), 
                                           false);
            FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, 
                                                (1U << TX_SHIFTER) | (1U << RX_SHIFTER), 
                                                false);
            /* Disable interrupt for SCL timer */
            FLEXIO_HAL_SetTimerInterrupt(baseAddr, (1U << SCL_TIMER), false);
            break;
        case FLEXIO_I2C_DRIVER_TYPE_POLLING:
            /* Nothing to do here */
            break;
        case FLEXIO_I2C_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    master->driverIdle = true;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterCheckNack
 * Description   : Checks if the current Rx shifter error is NACK or RX_OVERFLOW
 *                 
 *         If there is a Tx event active it is an indication that module was not 
 *         serviced for a long time - chances are this is an overflow.
 *         It is not certain, and it is even possible to have both NACK and overflow,
 *         but there is no way to tell, so we chose the safe option (if it is an 
 *         overflow and we abort the transfer we may block the I2C bus).
 *                 
 *
 *END**************************************************************************/
static inline bool FLEXIO_I2C_DRV_MasterCheckNack(FLEXIO_Type *baseAddr)
{
    return !(FLEXIO_HAL_GetShifterStatus(baseAddr, TX_SHIFTER));
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterBusBusy
 * Description   : Check status of the I2C bus.
 *                 If either SDA or SCL is low, the bus is busy.
 *
 *END**************************************************************************/
static inline bool FLEXIO_I2C_DRV_MasterBusBusy(FLEXIO_Type *baseAddr, flexio_i2c_master_state_t *master)
{
    uint8_t pinMask = (1 << master->sdaPin) | (1 << master->sclPin);
    if ((FLEXIO_HAL_GetPinData(baseAddr) & pinMask) == pinMask)
    {
        /* both pins are high, bus is not busy */
        return false;
    }
    else
    {
        /* bus is busy */
        return true;
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterCheckStatus
 * Description   : Check status of the I2C transfer. This function can be 
 *                 called either in an interrupt routine or directly in polling 
 *                 mode to advance the I2C transfer.
 *
 *END**************************************************************************/
void FLEXIO_I2C_DRV_MasterCheckStatus(uint32_t instance)
{
    FLEXIO_Type *baseAddr;
    flexio_i2c_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    /* Check for errors */
    if (FLEXIO_HAL_GetShifterErrorStatus(baseAddr, TX_SHIFTER))
    {
        master->status = FLEXIO_I2C_STATUS_TX_UNDERFLOW;
        FLEXIO_HAL_ClearShifterErrorStatus(baseAddr, TX_SHIFTER);
        /* don't stop the transfer, continue processing events */
    }
    if (FLEXIO_HAL_GetShifterErrorStatus(baseAddr, RX_SHIFTER))
    {
        /* Device limitation: not possible to tell the difference between NACK and receive overflow */
        FLEXIO_HAL_ClearShifterErrorStatus(baseAddr, RX_SHIFTER);
        if (FLEXIO_I2C_DRV_MasterCheckNack(baseAddr))
        {
            master->status = FLEXIO_I2C_STATUS_NACK;
            /* Force the ongoing transfer to stop */
            FLEXIO_I2C_DRV_MasterStopTransfer(instance);
            /* Stop processing events */
            return;
        }
        else
        {
            master->status = FLEXIO_I2C_STATUS_RX_OVERFLOW;
            /* don't stop the transfer, continue processing events */
        }
    }
    /* Check if data was received */
    if (FLEXIO_HAL_GetShifterStatus(baseAddr, RX_SHIFTER))
    {
        FLEXIO_I2C_DRV_ReadData(instance);
    }
    /* Check if transmitter needs more data */
    if (FLEXIO_HAL_GetShifterStatus(baseAddr, TX_SHIFTER))
    {
        FLEXIO_I2C_DRV_WriteData(instance);
        if (master->txRemainingBytes == 0) 
        {
            /* Done transmitting, disable Tx interrupt */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, (1U << TX_SHIFTER), false);
        }
    }
    /* Check if the transfer is over */
    if (FLEXIO_HAL_GetTimerStatus(baseAddr, SCL_TIMER))
    {
        /* Clear timer status */
        FLEXIO_HAL_ClearTimerStatus(baseAddr, SCL_TIMER);
        /* End transfer */
        FLEXIO_I2C_DRV_MasterEndTransfer(instance);
        /* Record success if there was no error */
        if (master->status == FLEXIO_I2C_STATUS_BUSY)
        {
            master->status = FLEXIO_I2C_STATUS_SUCCESS;
        }
    }
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterStartTransfer
 * Description   : Perform a send or receive transaction on the I2C bus
 *
 *END**************************************************************************/
static flexio_i2c_status_t FLEXIO_I2C_DRV_MasterStartTransfer(uint32_t instance,
                                                              uint8_t * buff,
                                                              uint32_t size,
                                                              bool sendStop,
                                                              bool receive)
{
    FLEXIO_Type *baseAddr;
    flexio_i2c_master_state_t *master;
    flexio_i2c_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

