arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_i2c_driver.c
    /* Check if driver is busy */
    if (!master->driverIdle)
    {
        return FLEXIO_I2C_STATUS_BUSY;
    }
    /* Check if bus is busy */
    if (FLEXIO_I2C_DRV_MasterBusBusy(baseAddr, master))
    {
        return FLEXIO_I2C_STATUS_BUS_BUSY;
    }
    /* Check if transfer size is in admissible range */
    if (size > FLEXIO_I2C_MAX_SIZE)
    {
        return FLEXIO_I2C_STATUS_SIZE;
    }
    if (master->needReinit)
    {
        /* Re-initialize module after a forced stop */
        retCode = FLEXIO_I2C_DRV_MasterConfigure(instance);
        if (retCode != FLEXIO_I2C_STATUS_SUCCESS)
        {
            return retCode;
        }
        FLEXIO_HAL_SetEnable(baseAddr, true);
        master->needReinit = false;
    }

    /* Initialize transfer data */
    master->data = (uint8_t *)buff;
    /* Tx - one extra byte for stop condition */
    master->txRemainingBytes = size + 1U;
    master->rxRemainingBytes = size;
    master->status = FLEXIO_I2C_STATUS_BUSY;
    master->driverIdle = false;
    master->sendStop = sendStop;
    master->receive = receive;
    master->addrReceived = false;

    /* Configure device for requested number of bytes, keeping the existing baud rate */
    FLEXIO_I2C_DRV_MasterSetBytesNo(baseAddr, master);

    /* Send address */
    FLEXIO_I2C_DRV_MasterSendAddress(baseAddr, master);

    /* Enable transfer engine */
    switch (master->driverType)
    {
        case FLEXIO_I2C_DRIVER_TYPE_INTERRUPTS:
            /* Enable interrupt for Tx and Rx shifters */
            FLEXIO_HAL_SetShifterInterrupt(baseAddr, 
                                           (1U << TX_SHIFTER) | (1U << RX_SHIFTER), 
                                           true);
            FLEXIO_HAL_SetShifterErrorInterrupt(baseAddr, 
                                                (1U << TX_SHIFTER) | (1U << RX_SHIFTER), 
                                                true);
            /* Enable interrupt for SCL timer */
            FLEXIO_HAL_SetTimerInterrupt(baseAddr, (1U << SCL_TIMER), true);
            break;
        case FLEXIO_I2C_DRIVER_TYPE_POLLING:
            /* Nothing to do here, FLEXIO_I2C_DRV_MasterGetStatus() will handle the transfer */
            break;
        case FLEXIO_I2C_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    return FLEXIO_I2C_STATUS_SUCCESS;
}

/*! @endcond */

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterInit
 * Description   : Initialize the FLEXIO_I2C master mode driver
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterInit(uint32_t instance,
                                              const flexio_i2c_master_user_config_t * userConfigPtr,
                                              flexio_i2c_master_state_t * master)
{
    FLEXIO_Type *baseAddr;
    interrupt_manager_error_code_t intErr;
    flexio_i2c_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(master != NULL);
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    if (g_flexioI2CStatePtr[instance])
    {
        return FLEXIO_I2C_STATUS_FAIL;
    }

    baseAddr = g_flexioBase[instance];
    g_flexioI2CStatePtr[instance] = master;

    /* Initialize driver context structure */
    master->driverType = userConfigPtr->driverType;
    master->slaveAddress = userConfigPtr->slaveAddress;
    master->sdaPin = userConfigPtr->sdaPin;
    master->sclPin = userConfigPtr->sclPin;
    master->baudRate = userConfigPtr->baudRate;
    master->driverIdle = true;
    master->needReinit = false;

    /* Initialize HAL */
    FLEXIO_HAL_Init(baseAddr);

    /* Configure device for I2C mode */
    retCode = FLEXIO_I2C_DRV_MasterConfigure(instance);
    if (retCode != FLEXIO_I2C_STATUS_SUCCESS)
    {
        g_flexioI2CStatePtr[instance] = NULL;
        return retCode;
    }

    /* Set up transfer engine */
    switch (master->driverType)
    {
        case FLEXIO_I2C_DRIVER_TYPE_INTERRUPTS:
            /* Install irq handler */
            intErr = INT_SYS_InstallHandler(g_flexioIrqId[instance], g_flexioI2CIsr[instance], NULL);
            if (intErr == INTERRUPT_MANAGER_ERROR)
            {
                return FLEXIO_I2C_STATUS_FAIL;
            }
            /* Enable FLEXIO interrupts in the interrupt manager */
            INT_SYS_EnableIRQ(g_flexioIrqId[instance]);
            break;
        case FLEXIO_I2C_DRIVER_TYPE_POLLING:
            /* Nothing to do here, FLEXIO_I2C_DRV_MasterGetStatus() will handle the transfer */
            break;
        case FLEXIO_I2C_DRIVER_TYPE_DMA:
            /* TODO: add DMA support */
            break;
        default: 
            /* Impossible type - do nothing */
            break;
    }

    /* Enable module */
    FLEXIO_HAL_SetEnable(baseAddr, true);

    return FLEXIO_I2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterDeinit
 * Description   : De-initialize the FLEXIO_I2C master mode driver
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterDeinit(uint32_t instance)
{
    flexio_i2c_master_state_t *master;
    interrupt_manager_error_code_t intErr;
    FLEXIO_Type *baseAddr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    /* Disable module */
    FLEXIO_HAL_SetEnable(baseAddr, false);

    /* Disable transfer engine */
    if (master != NULL)
    {
        switch (master->driverType)
        {
            case FLEXIO_I2C_DRIVER_TYPE_INTERRUPTS:
                /* Disable FLEXIO interrupt */
                INT_SYS_DisableIRQ(g_flexioIrqId[instance]);
                /* Restore default handler. */
                intErr = INT_SYS_InstallHandler(g_flexioIrqId[instance], DefaultISR, NULL);
                if (intErr == INTERRUPT_MANAGER_ERROR)
                {
                    return FLEXIO_I2C_STATUS_FAIL;
                }
                break;
            case FLEXIO_I2C_DRIVER_TYPE_POLLING:
                /* Nothing to do */
                break;
            case FLEXIO_I2C_DRIVER_TYPE_DMA:
                /* TODO: add DMA support */
                break;
            default: 
                /* Impossible type - do nothing */
                break;
        }
    }

    g_flexioI2CStatePtr[instance] = NULL;

    return FLEXIO_I2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterSetBaudRate
 * Description   : Set the baud rate for any subsequent I2C communication
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterSetBaudRate(uint32_t instance, uint32_t baudRate)
{
    FLEXIO_Type *baseAddr;
    flexio_i2c_master_state_t *master;
    uint16_t divider;
    uint16_t timerCmp;
    flexio_i2c_status_t retCode;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];
    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

