arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_i2c_driver.c
    /* Check if driver is busy */
    if (!master->driverIdle)
    {
        return FLEXIO_I2C_STATUS_BUSY;
    }

    master->baudRate = baudRate;
    /* Compute divider */
    retCode = FLEXIO_I2C_DRV_MasterComputeBaudRateDivider(instance, baudRate, &divider);
    if (retCode != FLEXIO_I2C_STATUS_SUCCESS)
    {
        return retCode;
    }

    /* Configure timer divider in the lower 8 bits of TIMCMP[CMP] */
    timerCmp = FLEXIO_HAL_GetTimerCompare(baseAddr, SCL_TIMER);
    timerCmp = (timerCmp & 0xFF00U) | divider;
    FLEXIO_HAL_SetTimerCompare(baseAddr, SCL_TIMER, timerCmp);

    return FLEXIO_I2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterGetBaudRate
 * Description   : Get the currently configured baud rate
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterGetBaudRate(uint32_t instance, uint32_t *baudRate)
{
    FLEXIO_Type *baseAddr;
    uint32_t inputClock;
    uint32_t divider;
    uint16_t timerCmp;
    clock_manager_error_code_t clkErr;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    baseAddr = g_flexioBase[instance];

    /* Get the protocol clock frequency */
    clkErr = CLOCK_SYS_GetFreq(g_flexioClock[instance], &inputClock);
    if ((clkErr != CLOCK_MANAGER_SUCCESS) || (inputClock == 0U))
    {
        /* No clock configured for this module */
        return FLEXIO_I2C_STATUS_FAIL;
    }

    /* Get the currently configured divider */
    timerCmp = FLEXIO_HAL_GetTimerCompare(baseAddr, SCL_TIMER);
    divider = (uint32_t)(timerCmp & 0x00FFU);

    /* Compute baud rate: input_clock / (2 * (divider + 2)). Round to nearest integer */
    *baudRate = (inputClock + divider + 2U) / (2U * (divider + 2U));

    return FLEXIO_I2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterSetSlaveAddr
 * Description   : Set the slave address for any subsequent I2C communication
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterSetSlaveAddr(uint32_t instance, const uint16_t address)
{
    flexio_i2c_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    /* Check if driver is busy */
    if (!master->driverIdle)
    {
        return FLEXIO_I2C_STATUS_BUSY;
    }

    master->slaveAddress = address;
    return FLEXIO_I2C_STATUS_SUCCESS;
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterSendData
 * Description   : Perform a non-blocking send transaction on the I2C bus
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterSendData(uint32_t instance,
                                                  const uint8_t * txBuff,
                                                  uint32_t txSize,
                                                  bool sendStop)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(txSize > 0);
#endif
    return FLEXIO_I2C_DRV_MasterStartTransfer(instance, (uint8_t *)txBuff, txSize, sendStop, false);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterSendDataBlocking
 * Description   : Perform a blocking send transaction on the I2C bus
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterSendDataBlocking(uint32_t instance,
                                                          const uint8_t * txBuff,
                                                          uint32_t txSize,
                                                          bool sendStop)
{
    flexio_i2c_status_t status;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
    DEV_ASSERT(txBuff != NULL);
    DEV_ASSERT(txSize > 0);
#endif

    /* Call FLEXIO_I2C_DRV_MasterSendData to start transfer */
    status = FLEXIO_I2C_DRV_MasterSendData(instance, txBuff, txSize, sendStop);
    if (status != FLEXIO_I2C_STATUS_SUCCESS)
    {
        /* Transfer could not be started */
        return status; 
    }

    /* Wait for transfer to end */
    return FLEXIO_I2C_DRV_MasterWaitTransferEnd(instance);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterReceiveData
 * Description   : Perform a non-blocking receive transaction on the I2C bus
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterReceiveData(uint32_t  instance,
                                                     uint8_t * rxBuff,
                                                     uint32_t rxSize,
                                                     bool sendStop)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(rxSize > 0);
#endif
    return FLEXIO_I2C_DRV_MasterStartTransfer(instance, rxBuff, rxSize, sendStop, true);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterReceiveDataBlocking
 * Description   : Perform a blocking receive transaction on the I2C bus
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterReceiveDataBlocking(uint32_t instance,
                                                        uint8_t * rxBuff,
                                                        uint32_t rxSize,
                                                        bool sendStop)
{
    flexio_i2c_status_t status;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
    DEV_ASSERT(rxBuff != NULL);
    DEV_ASSERT(rxSize > 0);
#endif

