arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexio/fsl_flexio_i2c_driver.c
    /* Call FLEXIO_I2C_DRV_MasterReceiveData to start transfer */
    status = FLEXIO_I2C_DRV_MasterReceiveData(instance, rxBuff, rxSize, sendStop);
    if (status != FLEXIO_I2C_STATUS_SUCCESS)
    {
        /* Transfer could not be started */
        return status; 
    }

    /* Wait for transfer to end */
    return FLEXIO_I2C_DRV_MasterWaitTransferEnd(instance);
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterTransferAbort
 * Description   : Aborts a non-blocking I2C master transaction
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterTransferAbort(uint32_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    /* can't abort safely due to device limitation; there is no way to know the exact 
       stage of the transfer, and if we disable the module during the ACK bit (transmit) 
       or during a data bit (receive) the slave will hold the SDA line low forever and 
       block the I2C bus. NACK reception is the only exception - there is no slave 
       to hold the line low */
    
    return FLEXIO_I2C_STATUS_FAIL;
    
#if 0
    /* Check if driver is busy */
    if (master->driverIdle)
    {
        return FLEXIO_I2C_STATUS_FAIL;
    }

    master->status = FLEXIO_I2C_STATUS_ABORTED;
    /* Force the ongoing transfer to stop */
    FLEXIO_I2C_DRV_MasterStopTransfer(instance);

    return FLEXIO_I2C_STATUS_SUCCESS;
#endif
}


/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXIO_I2C_DRV_MasterGetStatus
 * Description   : Get the status of the current non-blocking I2C master transaction
 *
 *END**************************************************************************/
flexio_i2c_status_t FLEXIO_I2C_DRV_MasterGetStatus(uint32_t instance, uint32_t *bytesRemaining)
{
    flexio_i2c_master_state_t *master;

#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < FLEXIO_INSTANCE_COUNT);
#endif

    master = (flexio_i2c_master_state_t *)g_flexioI2CStatePtr[instance];

    if ((!master->driverIdle) && (master->driverType == FLEXIO_I2C_DRIVER_TYPE_POLLING))
    {
        /* In polling mode advance the I2C transfer here */
        FLEXIO_I2C_DRV_MasterCheckStatus(instance);
    }

    if (bytesRemaining != NULL)
    {
        /* Use rxRemainingBytes even for transmit; byte is not transmitted 
           until rx shifter confirms the ACK */
        *bytesRemaining = master->rxRemainingBytes;
    }

    if (!master->driverIdle)
    {
        return FLEXIO_I2C_STATUS_BUSY;
    }
    else
    {
        return master->status;
    }
}


/*******************************************************************************
 * EOF
 ******************************************************************************/
